"""1.мы будем взаимодействовать с термилаом(это по сути командная строка), запускается оно через команду python manage.py(оно работает как django-admin)r
и там мы запускаем его с помощью команды runserver(мы там можем переименовывать ссылку на наш локальный сервак).
также пока сервер работает мы не можем обращаться к терминалу(но можем создать другой!!!), чтобы остановить сервер(он работает в реальном времени и также мы можем к нему обращаться
с помощью перезагрузки сайта) надо ctrl+c, после этого его не будет """
"""2. теперь про то как писать свой код это будет немного про приложения(apps) работаем с командой python manage.py startapp + name (название нашего файла)
"""